Autodesk.Revit.DB.NumericRevisionSettings.IsEqual(Autodesk.Revit.DB.NumericRevisionSettings)
Determines whether a specified NumericRevisionSettings is the same as 'this'.
Remarks:
The two NumericRevisionSettings are regarded as the same only if they have the same start number,
prefix and suffix strings.
other:
The specified NumericRevisionSettings with which to compare.
Returns:
True, if two NumericRevisionSettings are the same.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.NumericRevisionSettings.Suffix
The suffix string that will be appended to the number of each revision with Numeric RevisionNumberingType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.NumericRevisionSettings.Prefix
The prefix string that will be prepended to the number of each revision with Numeric RevisionNumberingType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.NumericRevisionSettings.MinimumDigits
Controls the minimum number of digits for a revision number.
Remarks:
Use MinimumDigits to force the minimum number of digits for a revision number.
Zeros will be added to the front of the revision number until the minimum number of digits is satisfied.
For example, if MinimumDigits is 3, then 9 will be printed as 009 and 10 will be printed as 010.
If MinimumDigits is 1, then no zeros are added to the front of the revision number.
The default value for MinimumDigits is 1. Values less than 1 are not allowed.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for minimumDigits is not positive.
Since:
2022

Autodesk.Revit.DB.NumericRevisionSettings.#ctor(System.Int32,System.String,System.String)
Constructs a NumericRevisionSettings object.
Remarks:
The starting number parameter accepts any non-negative integer, and
the prefix and suffix strings are allowed to be empty.
startNumber:
The start number for the sequence.
prefix:
The prefix string for each revision number in the sequence.
suffix:
The suffix string for each revision number in the sequence.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for startNumber is negative.
Since:
2016

Autodesk.Revit.DB.NumericRevisionSettings.#ctor(Autodesk.Revit.DB.NumericRevisionSettings)
Constructs a new copy of the input NumericRevisionSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
other is not a valid NumericRevisionSettings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016